dbbench-result/bourbon20m.txt
mod: 7
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    20000000
RawSize:    2212.5 MB (estimated)
FileSize:   1258.9 MB (estimated)
------------------------------------------------
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter  0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
fillrandom   :       2.740 micros/op;   40.4 MB/s;    54.791
readrandom   :       4.478 micros/op;   24.7 MB/s (19999998 of 20000000 found);    89.557
99p          :  897238.000 micros/op; 99 percentile latency: 6376 ns;     0.897
--------------------------------------------------
memtable stall time: 0.91135 s
L0 stall time: 0  s
L0 slow stall time: 39.2337  s
waf:10.2217
------About File Model------
total segments: 1429043
final models : 2965
avg segments: 481
------About File Model------
Timer 0: 4307883008 : 4.307883008
Timer 1: 2182890496 : 2.182890496
Timer 2: 3241716 : 0.003241716
Timer 3: 3577429 : 0.003577429
Timer 4: 0 : 0.000000000
Timer 5: 7713571 : 0.007713571
Timer 6: 19031928832 : 19.031928832
Timer 7: 58551836672 : 58.551836672
Timer 8: 552299008 : 0.552299008
Timer 9: 0 : 0.000000000
Timer 10: 0 : 0.000000000
Timer 11: 17619683328 : 17.619683328
Timer 12: 8857500672 : 8.857500672
Timer 13: 0 : 0.000000000
Timer 14: 8842468352 : 8.842468352
Timer 15: 269194080 : 0.269194080
Timer 16: 7785646080 : 7.785646080
Timer 17: 5842819072 : 5.842819072
Timer 18: 4505284096 : 4.505284096
Timer 19: 4306848256 : 4.306848256

                               Compactions
Level  Files  Size(MB) Time(sec) M_Time(micros) Read(MB) Write(MB)  M_Read(MB) M_Write(MB) Count 
------------------------------------------------------------------------------------------------ 
  0         3         8       21         0        1361       2085          0          0       35
  1         6         8       28     56321        3167       3026          6          6      333
  2        56        99        3     30187         432        388          3          4       77
  3       216       422        0         0           0          0          0          0        0

Counter LevelModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FileModel 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Baseline 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Succeeded 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseInternal 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter Compaction -2147483648 16171231712 37552308672 4828216320 0 0 0 0 0
635 35 359 241 0 0 0 0 0
Counter Learn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter SuccessTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FalseTime 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter FilteredLookup 1069854720 692068352 81997824 131809280 163979264 0 0 0 0
92291764 59483722 7170328 11330007 14307707 0 0 0 0
Counter PutWait 37292 37284 8 0 0 0 0 0 0
37292 37284 8 0 0 0 0 0 0
Counter FileLearning -2147483648 2337391008 4131866976 9947651720 1202161664 0 0 0 0
2965 279 802 1659 225 0 0 0 0
Counter LevelLearn 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelUse 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LevelModelNotUse 52971402 0 19548024 19115671 14307707 0 0 0 0
52971402 0 19548024 19115671 14307707 0 0 0 0
Counter BaselineNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMNegative 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter BaselinePositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0
Counter LLSMPositive 0 0 0 0 0 0 0 0 0
0 0 0 0 0 0 0 0 0